//NSG Changes by Resource and Who did it

AzureActivity
| where OperationNameValue =~ "MICROSOFT.NETWORK/NETWORKSECURITYGROUPS/WRITE" and ActivityStatusValue =~ "Success"
| distinct _ResourceId, Caller
| extend AccountCustomEntity = Caller
