//Looking for systems that have two different IP addresses that share the same MAC address for potential ARP Poisoning.
//Defender for Endpoint is required for the DeviceNetworkInfo table.

DeviceNetworkInfo
| where isnotempty(IPv4Dhcp) and isnotempty(MacAddress)
| summarize 
    DistinctIPs = make_set(IPv4Dhcp), 
    DistinctDevices = make_set(DeviceName), 
    IPCount = dcount(IPv4Dhcp), 
    DeviceCount = dcount(DeviceName) 
    by MacAddress
| where IPCount > 1 and DeviceCount > 1
