//DarkSide ransomware behavior. Defender for Endpoint connected to Sentinel.

DeviceProcessEvents 
| where FileName =~ "rundll32.exe" 
| where ProcessCommandLine matches regex @".dll,#(?:1|3) worker[0-9]\sjob[0-9]-[0-9]{4,}"
