//Detect if Defender AV is not successful in remediating the detection

DeviceEvents
| where ActionType == "AntivirusDetection"
| extend ParsedFields=parse_json(AdditionalFields)
| project ThreatName=tostring(ParsedFields.ThreatName),
         WasRemediated=tobool(ParsedFields.WasRemediated),
         WasExecutingWhileDetected=tobool(ParsedFields.WasExecutingWhileDetected),
         FileName, SHA1, InitiatingProcessFileName, InitiatingProcessCommandLine,
         DeviceName
// Change "!=" to "==" see all remediated actions
| where WasRemediated != "true"
