//Show how many alerts have been generated by a specific service. Example here is MCAS. Change Product to the service you want info on.

SecurityIncident
| extend Product = todynamic((parse_json(tostring(AdditionalData.alertProductNames))[0])) 
| where Product has "Microsoft Cloud App Security"
| summarize count() by tostring(AlertIds)
| summarize sum(count_)