//This will produce results to show when links have been created in Teams chats and channels. Will not show actual link, though. Still working on that.

OfficeActivity
| where OfficeWorkload =~ "MicrosoftTeams"
| where Operation in ("MessageCreatedHasLink", "MessageEditedHasLink")
