//Number of Incidents closed in the last 90 days

SecurityIncident
| where TimeGenerated > startofday(ago(90d))
| where ProviderName == "Azure Sentinel" // Commenting out this line provides SecurityIncidents from both Azure Sentinel and Microsoft 365 Defender Incidents.
| summarize arg_max(TimeGenerated, Status, Severity, Owner, AdditionalData) by IncidentNumber
| where Status == "Closed"
| summarize count() by Status
