SecurityEvent
| where ProcessName contains "powershell.exe" or ProcessName contains "powershell_ise.exe"
| project TimeGenerated, Computer, SubjectUserName, SubjectDomainName, Process, CommandLine, ParentProcessName
