SecurityEvent
| where ProcessName has "powershell.exe" or ProcessName has "powershell_ise.exe"
| project TimeGenerated, Computer, SubjectUserName, SubjectDomainName, Process, CommandLine, ParentProcessName
