//Display all processes initiated by a source IP during an RDP session. 

DeviceProcessEvents 
| where Timestamp >= ago(1d) 
| where IsInitiatingProcessRemoteSession == "True" 
| where InitiatingProcessRemoteSessionIP == "X.X.X.X" // Insert your IP Address here 
| project InitiatingProcessFileName, InitiatingProcessAccountSid, InitiatingProcessCommandLine, FileName, ProcessCommandLine 
