let IncidentURL = "https://portal.azure.com/#asset/Microsoft_Azure_Security_Insights/Incident"; 
AzureActivity
| where _ResourceId has "Microsoft.SecurityInsights" and _ResourceId has "incidents"
| summarize by _ResourceId
| extend IncidentLINK = strcat(IncidentURL, _ResourceId)
| distinct IncidentLINK
