//Based on SolarWinds IOCs:  https://www.solarwinds.com/trust-center/security-advisories/cve-2021-35211

let SolarU_IPs = pack_array("98.176.196.89", "68.235.178.32", "208,113,35,58");
DeviceNetworkEvents
| where TimeGenerated >= (7d)
| where RemotePort == 443
| where Protocol == "Tcp" and ActionType == "ConnectionSuccess"
| where RemoteIP in(SolarU_IPs)
