//When UEBA was enabled and by who

AzureActivity
| where Properties_d has "microsoft.securityinsights/ueba"
| extend WhoDidIt = Caller
| project WhoDidIt, CallerIpAddress, EventSubmissionTimestamp
