AuditLogs
| where OperationName contains "self-service"
| where Result == "success"
| extend userPrincipalName_ = tostring(parse_json(tostring(InitiatedBy.user)).userPrincipalName)
| project userPrincipalName_
