//Query to show events in just the workweek

let workweek = datatable(dayOfWeekTimespan:int, dayOfWeekDayDisplayName:string, firstH:int, lastH:int) [ 0, "Sunday", 9, 18, 1, "Monday", 9, 18, 2, "Tuesday", 9, 18, 3, "Wednesday", 9, 18, 4, "Thursday", 9, 18, 5, "Friday", 9, 18, 6, "Saturday", 9, 18, ];
let startDate = ago(60d); let endDate = now();
SecurityEvent
| where TimeGenerated between (startDate .. endDate)
| extend dayOfWeekTimespan = toint(substring(tostring(dayofweek(TimeGenerated)), 0, 1)) 
| where dayOfWeekTimespan in (1, 2, 3, 4, 5) 
| lookup kind=leftouter workweek on dayOfWeekTimespan 
| where datetime_part("Hour",TimeGenerated) between (firstH .. lastH) 
| project TimeGenerated, Computer, dayOfWeekDayDisplayName 
| sort by TimeGenerated asc
